-- Исполнители
INSERT INTO singer(name) 
VALUES('Агата Кристи'),('Агутин Леонид'),
('Билан Дмитрий'),('Брежнева Вера'),
('Агата Кристи'),('Агата Кристи'),('А');

-- жанры
INSERT INTO genre (name) 
VALUES('Рок'),('Поп'),('Шансон');

-- Альбомы 
INSERT INTO album (name, year_al)
VALUES('Я ночной хулиган', 2003), ('Опиум', 1995),('Лучший день', 2019),
('Босоногий мальчик', 1994),('Любовь спасет мир', 2010);

-- Треки
INSERT INTO track (name, duration, album_id)
VALUES('Любовь спасет мир', 213, 4),('Нирвана', 150, 4),
('Босоногий мальчик', 206, 5),('Следом за весной', 199, 5),
('Метель', 195, 3),('Кто, если не ты', 190, 3),
('Мулатка', 210, 2),('Я ночной хулиган', 300, 2),
('Абордаж', 250, 1), ('Сказочная тайна', 260, 1);

-- сборники
INSERT INTO collection (name, year_col)
VALUES('Поп хит', 2000),('Сборник хитов', 1999),
('Русские песни', 2000),('Русский хит', 2010),
('Самые яркие треки', 2006);

--коллекциитреки
INSERT INTO collectiontrack  (collection_id, track_id)
VALUES(1, 1),(1, 3),(1, 7),(1, 8),(1, 6),
(2, 1),(2, 7),(2, 8),(2, 9),(2, 10),(3, 2),(3, 1),
(3, 3),(4, 8),(4, 9),(4, 10),(5, 2),(5, 6),(5, 3);

-- жанры и исполнители
INSERT INTO genresinger (genre_id, singer_id)
VALUES(1, 1),(1, 1),(2, 3),(2, 4),(3, 5),(2, 2);

-- исполнители и альбомы
INSERT INTO singeralbum (album_id, singer_id)
VALUES(1, 1),(2, 3),(3, 5),(4, 4),(5, 2);



